0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (13 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (13 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (13 0 0);
    }
    bajaSurface
    {
        type            noSlip; // Air "sticks" to the car
    }
    sides
    {
        type            slip;
    }
    topBottom
    {
        type            slip;
    }
}
