0.orig/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0.63;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bajaSurface
    {
        type            kLowReWallFunction;
        value           $internalField;
    }
    sides
    {
        type            slip;
    }
    topBottom
    {
        type            slip;
    }
}
