0.orig/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 30.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bajaSurface
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    sides
    {
        type            slip;
    }
    topBottom
    {
        type            slip;
    }
}
