constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          4800;
        startFace       4102805;
    }
    outlet
    {
        type            patch;
        nFaces          4800;
        startFace       4107605;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24000;
        startFace       4112405;
    }
    topBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          34011;
        startFace       4136405;
    }
    bajaSurface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80890;
        startFace       4170416;
    }
)

// ************************************************************************* //
