system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 10                                     |
|   \\  /    A nd           | Web:      www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    // Bottom plane
    (-5 -2 -1)    // 0: back-left-bottom
    (5 -2 -1)     // 1: front-left-bottom
    (5 2 -1)      // 2: front-right-bottom
    (-5 2 -1)     // 3: back-right-bottom

    // Top plane
    (-5 -2 2)     // 4: back-left-top
    (5 -2 2)      // 5: front-left-top
    (5 2 2)       // 6: front-right-top
    (-5 2 2)      // 7: back-right-top
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 80 60) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    sides
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 1 5 4)
        );
    }
    topBottom
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);
